
## Plan Result (aat)




<pre><code>Plan: 4 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.hmc-servicebus-connection-string
  * azurerm_key_vault_secret.hmc-servicebus-shared-access-key-tf
  * module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription
  * module.servicebus-subscription.azurerm_servicebus_subscription_rule.correlation_filter_rules[&#34;hmctsProperty_filter&#34;]
* Update
  * module.pcs_redis.azurerm_redis_cache.redis


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.hmc-servicebus-connection-string will be created
  + resource "azurerm_key_vault_secret" "hmc-servicebus-connection-string" {
      + content_type            = "secret"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcs-aat/providers/Microsoft.KeyVault/vaults/pcs-aat"
      + name                    = "hmc-servicebus-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "possession-claim-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pcs-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcs-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Possession Claim Service"
          + "source"              = "Vault /subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcs-aat/providers/Microsoft.KeyVault/vaults/pcs-aat"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.hmc-servicebus-shared-access-key-tf will be created
  + resource "azurerm_key_vault_secret" "hmc-servicebus-shared-access-key-tf" {
      + content_type            = "secret"
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcs-aat/providers/Microsoft.KeyVault/vaults/pcs-aat"
      + name                    = "hmc-servicebus-shared-access-key"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = {
          + "application"         = "possession-claim-service"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/pcs-shared-infrastructure.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#pcs-tech"
          + "environment"         = "staging"
          + "managedBy"           = "Possession Claim Service"
          + "source"              = "Vault /subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcs-aat/providers/Microsoft.KeyVault/vaults/pcs-aat"
        }
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.pcs_redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/pcs-aat/providers/Microsoft.Cache/redis/pcs-aat"
        name                               = "pcs-aat"
        tags                               = {
            "application"         = "possession-claim-service"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/pcs-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pcs-tech"
            "environment"         = "staging"
            "managedBy"           = "Possession Claim Service"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (14 unchanged attributes hidden)
        }
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription.servicebus_subscription will be created
  + resource "azurerm_servicebus_subscription" "servicebus_subscription" {
      + auto_delete_on_idle                       = "P10675199DT2H48M5.4775807S"
      + batched_operations_enabled                = false
      + client_scoped_subscription_enabled        = false
      + dead_lettering_on_filter_evaluation_error = true
      + dead_lettering_on_message_expiration      = true
      + default_message_ttl                       = "P10675199DT2H48M5.4775807S"
      + id                                        = (known after apply)
      + lock_duration                             = "PT1M"
      + max_delivery_count                        = 10
      + name                                      = "hmc-to-pcs-subscription-aat"
      + requires_session                          = false
      + status                                    = "Active"
      + topic_id                                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/hmc-shared-aat/providers/Microsoft.ServiceBus/namespaces/hmc-servicebus-aat/topics/hmc-to-cft-aat"
        # (2 unchanged attributes hidden)
    }

  # module.servicebus-subscription.azurerm_servicebus_subscription_rule.correlation_filter_rules["hmctsProperty_filter"] will be created
  + resource "azurerm_servicebus_subscription_rule" "correlation_filter_rules" {
      + filter_type                    = "CorrelationFilter"
      + id                             = (known after apply)
      + name                           = "hmctsProperty_filter"
      + sql_filter_compatibility_level = (known after apply)
      + subscription_id                = (known after apply)

      + correlation_filter {
          + properties = {
              + "hmctsProperty" = "AAA3"
            }
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":16,"Program":"tfcmt","SHA1":"","Target":"aat","Vars":{}} -->